tests/phpunit/dummy-data/subscription_renewal_response_authentication_required.json

{
   "error":{
      "charge":"ch_123abc",
      "code":"authentication_required",
      "decline_code":"authentication_required",
      "message":"Your card was declined. This transaction requires authentication.",
      "payment_intent":{
         "id":"pi_123abc",
         "object":"payment_intent",
         "amount":2000,
         "amount_capturable":0,
         "amount_received":0,
         "application":null,
         "application_fee_amount":null,
         "canceled_at":null,
         "cancellation_reason":null,
         "capture_method":"automatic",
         "charges":{
            "object":"list",
            "data":[
               {
                  "id":"ch_123abc",
                  "object":"charge",
                  "amount":2000,
                  "amount_refunded":0,
                  "application":null,
                  "application_fee":null,
                  "application_fee_amount":null,
                  "balance_transaction":null,
                  "billing_details":{
                     "email":"admin@example.org",
                     "name":"Jeroen Sormani"
                  },
                  "captured":false,
                  "created":1565731413,
                  "currency":"gpb",
                  "customer":"cus_123abc",
                  "description":"",
                  "destination":null,
                  "dispute":null,
                  "failure_code":"authentication_required",
                  "failure_message":"Your card was declined. This transaction requires authentication.",
                  "fraud_details":{

                  },
                  "invoice":null,
                  "livemode":false,
                  "metadata":{
                     "customer_name":"Jeroen Sormani",
                     "customer_email":"admin@example.org",
                     "order_id":"6",
                     "payment_type":"recurring"
                  },
                  "on_behalf_of":null,
                  "order":null,
                  "outcome":{
                     "network_status":"declined_by_network",
                     "reason":"authentication_required",
                     "risk_level":"normal",
                     "risk_score":45,
                     "seller_message":"The bank returned the decline code `authentication_required`.",
                     "type":"issuer_declined"
                  },
                  "paid":false,
                  "payment_intent":"pi_123abc",
                  "payment_method":"src_123abc",
                  "payment_method_details":{
                     "card":{
                        "brand":"visa",
                        "checks":{
                           "address_line1_check":"pass",
                           "address_postal_code_check":"pass",
                           "cvc_check":"pass"
                        },
                        "country":"FR",
                        "exp_month":2,
                        "exp_year":2022,
                        "fingerprint":"123abc",
                        "funding":"credit",
                        "last4":"3155",
                        "three_d_secure":null,
                        "wallet":null
                     },
                     "type":"card"
                  },
                  "receipt_email":null,
                  "receipt_number":null,
                  "receipt_url":"https:\/\/pay.stripe.com\/receipts\/acct_123abc\/ch_123abc\/rcpt_123abc",
                  "refunded":false,
                  "refunds":{
                     "object":"list",
                     "data":[

                     ],
                     "has_more":false,
                     "total_count":0,
                     "url":"\/v1\/charges\/ch_123abc\/refunds"
                  },
                  "review":null,
                  "shipping":null,
                  "source":{
                     "id":"src_123abc",
                     "object":"source",
                     "amount":null,
                     "card":{
                        "exp_month":2,
                        "exp_year":2022,
                        "last4":"3155",
                        "country":"FR",
                        "brand":"Visa",
                        "address_line1_check":"pass",
                        "address_zip_check":"pass",
                        "cvc_check":"pass",
                        "funding":"credit",
                        "fingerprint":"123abc",
                        "three_d_secure":"required",
                        "name":null,
                        "tokenization_method":null,
                        "dynamic_last4":null
                     },
                     "client_secret":"src_client_secret_123abc",
                     "created":1566001579,
                     "currency":null,
                     "customer":"cus_123abc",
                     "flow":"none",
                     "livemode":false,
                     "metadata":{

                     },
                     "owner":{
                        "email":"admin@example.org",
                        "name":"Jeroen Sormani",
                        "verified_address":null,
                        "verified_email":null,
                        "verified_name":null,
                        "verified_phone":null
                     },
                     "statement_descriptor":null,
                     "status":"chargeable",
                     "type":"card",
                     "usage":"reusable"
                  },
                  "source_transfer":null,
                  "statement_descriptor":null,
                  "statement_descriptor_suffix":null,
                  "status":"failed",
                  "transfer_data":null,
                  "transfer_group":null
               }
            ],
            "has_more":false,
            "total_count":1,
            "url":"\/v1\/charges?payment_intent=pi_123abc"
         },
         "client_secret":"pi_123abc_secret_123abc",
         "confirmation_method":"automatic",
         "created":1565731413,
         "currency":"gpb",
         "customer":"cus_123abc",
         "description":"",
         "invoice":null,
         "last_payment_error":{
            "charge":"ch_123abc",
            "code":"authentication_required",
            "decline_code":"authentication_required",
            "message":"Your card was declined. This transaction requires authentication.",
            "source":{
               "id":"src_123abc",
               "object":"source",
               "amount":null,
               "card":{
                  "exp_month":2,
                  "exp_year":2022,
                  "last4":"3155",
                  "country":"FR",
                  "brand":"Visa",
                  "address_line1_check":"pass",
                  "address_zip_check":"pass",
                  "cvc_check":"pass",
                  "funding":"credit",
                  "fingerprint":"123abc",
                  "three_d_secure":"required",
                  "name":null,
                  "tokenization_method":null,
                  "dynamic_last4":null
               },
               "client_secret":"src_client_secret_123abc",
               "created":1565731413,
               "currency":null,
               "customer":"cus_123abc",
               "flow":"none",
               "livemode":false,
               "metadata":{

               },
               "owner":{
                  "email":"admin@example.org",
                  "name":"Jeroen Sormani",
                  "verified_address":null,
                  "verified_email":null,
                  "verified_name":null,
                  "verified_phone":null
               },
               "statement_descriptor":null,
               "status":"chargeable",
               "type":"card",
               "usage":"reusable"
            },
            "type":"card_error"
         },
         "livemode":false,
         "metadata":{
            "customer_name":"Jeroen Sormani",
            "customer_email":"admin@example.org",
            "order_id":"6",
            "payment_type":"recurring"
         },
         "next_action":null,
         "on_behalf_of":null,
         "payment_method":null,
         "payment_method_options":{
            "card":{
               "request_three_d_secure":"automatic"
            }
         },
         "payment_method_types":[
            "card"
         ],
         "receipt_email":null,
         "review":null,
         "setup_future_usage":null,
         "shipping":null,
         "source":null,
         "statement_descriptor":null,
         "statement_descriptor_suffix":null,
         "status":"requires_payment_method",
         "transfer_data":null,
         "transfer_group":null
      },
      "source":{
         "id":"src_123abc",
         "object":"source",
         "amount":null,
         "card":{
            "exp_month":2,
            "exp_year":2022,
            "last4":"3155",
            "country":"FR",
            "brand":"Visa",
            "address_line1_check":"pass",
            "address_zip_check":"pass",
            "cvc_check":"pass",
            "funding":"credit",
            "fingerprint":"123abc",
            "three_d_secure":"required",
            "name":null,
            "tokenization_method":null,
            "dynamic_last4":null
         },
         "client_secret":"src_client_secret_123abc",
         "created":1565731413,
         "currency":null,
         "customer":"cus_123abc",
         "flow":"none",
         "livemode":false,
         "metadata":{

         },
         "owner":{
            "email":"admin@example.org",
            "name":"Jeroen Sormani",
            "verified_address":null,
            "verified_email":null,
            "verified_name":null,
            "verified_phone":null
         },
         "statement_descriptor":null,
         "status":"chargeable",
         "type":"card",
         "usage":"reusable"
      },
      "type":"card_error"
   }
}